
       IDENTIFICATION DIVISION.
       PROGRAM-ID. subCobol.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  Num1          PIC 9(5).
       01  Num2          PIC 9(5).
       01  Resultado     PIC 9(5).

       PROCEDURE DIVISION.
           DISPLAY "Digite o primeiro número: ".
           ACCEPT Num1.
           DISPLAY "Digite o segundo número: ".
           ACCEPT Num2.

           SUBTRACT Num2 FROM Num1 GIVING Resultado.
           DISPLAY "A subtração é: " Resultado.

           STOP RUN.
           END PROGRAM. subCobol.
